#+TITLE: 6.338 lecture 9: solving stiff ordinary differential equations
#+AUTHOR: james gilles
#+EMAIL: jhgilles@mit.edu
#+DATE: 07 october 2019
#+OPTIONS: tex:t latex:t
#+STARTUP: latexpreview

#+LATEX_HEADER: \newcommand{\fv}[0]{\mathbf{f}}
#+LATEX_HEADER: \newcommand{\eps}[0]{\epsilon}
#+LATEX_HEADER: \newcommand{\cK}[0]{\mathcal{K}}

#+LATEX_HEADER: \newcommand{\R}[0]{\mathbb{R}}
#+LATEX_HEADER: \newcommand{\B}[0]{\mathcal{B}}
#+LATEX_HEADER: \newcommand{\xv}[0]{\mathbf{x}}
#+LATEX_HEADER: \newcommand{\yv}[0]{\mathbf{y}}
#+LATEX_HEADER: \newcommand{\fv}[0]{\mathbf{f}}
#+LATEX_HEADER: \newcommand{\lv}[0]{\mathbf{l}}
#+LATEX_HEADER: \newcommand{\vv}[0]{\mathbf{v}}
#+LATEX_HEADER: \newcommand*\lgrad[1]{\bar{#1}}

#+LATEX_HEADER: \newcommand{\eps}[0]{\epsilon}

#+LATEX_HEADER: \newcommand*{\approxident}{%
#+LATEX_HEADER: \mathrel{\vcenter{\offinterlineskip
#+LATEX_HEADER: \hbox{$\sim$}\vskip-.35ex\hbox{$\sim$}\vskip}}}


** machine epsilon and roundoff error
   64 bits of accuracy gives you ~16 base-10 digits of precision
   that is, the roundoff error is

   there are as many floats from 0-1 as there are from 1-$\infty$

   (*jhg*: can you shift computations to be around 0?)

   there are fixed point numbers. why not use them? why is this this way?

   floating point representation:

   [sign] [mantissa] [exponent]

   $\pm \; \mathtt{m.antissa} * 2^\mathtt{exponent}$

   machine epsilon $E$ s.t. $1 + E = 1$

   #+BEGIN_SRC jupyter-julia :session jl :async yes
  e = eps(1.)
  e, 1. + (e * .5), 1. + (e * .50001)
   #+END_SRC

   #+RESULTS:
   | 2.220446049250313e-16 | 1.0 | 1.0000000000000002 |

   example: subtraction:

   #+BEGIN_SRC
    1.512832...
  - 1.512848...
  -------------
  - 0.000016...
   #+END_SRC

   you lose 5 digits of precision!

  #+BEGIN_SRC jupyter-julia :session jl :async yes
  e = 1e-10rand()
  @show e
  @show 1 + e
  ()
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  : e = 7.0183027074124604e-12
  : 1 + e = 1.0000000000070184

  :END:

   computation of derivatives: look at *finite differencing*:

   $$f'(x) = \lim_{\epsilon \to 0} \frac{f(x + \epsilon) - f(x)}{\epsilon}$$

   really neat plot of numerical error as epsilon shrinks

   best you can ever do with finite differencing is ~7 base-10 digits of accuracy

   this is alarming! with jacobian + factoring, we're down to 3 digits of accuracy for each step!

